name: "ensemble_yolo_trt"
platform: "ensemble"
max_batch_size: 4

input [
  {
    name: "INPUT",
    data_type: TYPE_UINT8,
    dims: [ -1 ]
  }
]
output [
  {
    name: "OUTPUT",
    data_type: TYPE_FP16,
    dims: [ 300, 6 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocess",
      model_version: -1,
      input_map { key: "INPUT_0", value: "INPUT"},
      output_map { key: "preprocessed_image", value: "preprocessed_image" },
      output_map { key: "input_shape", value: "input_shape"}
    },
    {
      model_name: "yolo_trt"
      model_version: -1
      input_map { key: "images", value: "preprocessed_image" },
      output_map { key: "output", value: "infer_output" }
    },
    {
      model_name: "postprocess"
      model_version: -1
      input_map { key: "INPUT__0", value: "infer_output" },
      input_map { key: "INPUT__1", value: "input_shape" },
      output_map { key: "OUTPUT__0", value: "OUTPUT" }
    }
  ]
}
