name: "yolo_trt"
platform: "tensorrt_plan"
max_batch_size: 8

input {
  name: "images"
  data_type: TYPE_FP32
  dims: [3, 384, 640]
}

output {
  name: "output"
  data_type: TYPE_FP32
  dims: [84, 5040]
}

dynamic_batching {
  preferred_batch_size: [1, 4, 8]
  max_queue_delay_microseconds: 16000
}

instance_group {
  kind: KIND_GPU
  count: 1
}

optimization {
  cuda {
    graphs: true
  }
  execution_accelerators {
    gpu_execution_accelerator: { name: "tensorrt" }
  }
}
